ИС_СПОРТ_2022/src/DataProcessors/РабочийСтолМетодист/РабочийСтолМетодист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтолМетодист</name>
</mdclass:DataProcessor>

ИС_СПОРТ_2022/src/Enums/ПолФизическогоЛица/ПолФизическогоЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПолФизическогоЛица</name>
  <enumValues>
    <name>Женский</name>
  </enumValues>
  <enumValues>
    <name>Мужской</name>
  </enumValues>
</mdclass:Enum>

ИС_СПОРТ_2022/src/Documents/Соревнование/Соревнование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Соревнование</name>
  <registerRecords>InformationRegister.УчастникиСоревнований</registerRecords>
  <attributes>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСоревнования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Секретарь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Рефери</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгруженВСистемуХронометража</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПараметров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодсчетаРезультата</name>
    <type>
      <types>EnumRef.ТипПодсчетаРезультата</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРезультата</name>
    <type>
      <types>EnumRef.ТипыРезультатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСоревнования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЖюри</name>
    <attributes>
      <name>Судья</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлавныйСудья</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииСпортивныхСудей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>GUIDУчастника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Жеребьевка</name>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозицииВГруппе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/СоревнованиеОФПСдачаНормативов/СоревнованиеОФПСдачаНормативов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СоревнованиеОФПСдачаНормативов</name>
  <registerRecords>InformationRegister.УчастникиСоревнованийОФПСдачаНормативов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоревнования</name>
    <type>
      <types>EnumRef.ТипыСдачиНормативов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Секретарь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставЖюри</name>
    <attributes>
      <name>Судья</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлавныйСудья</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииСпортивныхСудей</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Жеребьевка</name>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Пол</name>
      <type>
        <types>EnumRef.ПолФизическогоЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозицииВГруппе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявленныеНормативы</name>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>УникальныйИдентификаторНорматива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/DataProcessors/РабочийСтолМетодист/Forms/ФормаРасшифровка/Module.bsl
#Область ОбработчкиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Раздел = Параметры.Раздел;
	ИмяСтраницы = Параметры.Страница;
	
	Если Раздел = "Соревнования" Тогда
	
		СоревнованиеСсылка = Параметры.СоревнованиеСсылка;
				
		ЭтоСоревнование = ТипЗнч(СоревнованиеСсылка) = Тип("ДокументСсылка.Соревнование");
		
		ПредставлениеДокумента = ?(ЭтоСоревнование, СоревнованиеСсылка, "" + СоревнованиеСсылка.Наименование + " " + Формат(СоревнованиеСсылка.ДатаНачалаСоревнования, "ДФ=dd.MM.yyyy"));
		ЭтаФорма.Заголовок = "" + ПредставлениеДокумента + ": Спортсмены";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СоревнованиеСоставУчастников.Ссылка КАК Ссылка,
		|	СоревнованиеСоставУчастников.НомерСтроки КАК НомерСтроки,
		|	СоревнованиеСоставУчастников.Спортсмен КАК Спортсмен,
		|	СоревнованиеСоставУчастников.Дисциплина КАК Дисциплина,
		|	СоревнованиеСоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
		|	СоревнованиеСоставУчастников.Команда КАК Команда,
		|	СоревнованиеСоставУчастников.Тренер КАК Тренер
		|ИЗ
		|	Документ.Соревнование.СоставУчастников КАК СоревнованиеСоставУчастников
		|ГДЕ
		|	СоревнованиеСоставУчастников.Ссылка = &Ссылка
		|	И 1 = 1
		|	И 2 = 2
		|
		|УПОРЯДОЧИТЬ ПО
		|	Спортсмен
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("Ссылка", СоревнованиеСсылка);
		
		Если НЕ ЭтоСоревнование Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.Соревнование.", "Документ.СоревнованиеОФПСдачаНормативов.");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СоревнованиеСоставУчастников.Команда", "NULL");
		КонецЕсли;	
		
		Если Параметры.Свойство("СоревнованиеГруппа") Тогда
			
			СоревнованиеГруппа = Параметры.СоревнованиеГруппа;
			СоревнованиеГруппа = СтрЗаменить(СоревнованиеГруппа, ",", "");
			СоревнованиеГруппаСсылка = НайтиГруппу(СоревнованиеГруппа);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "СоревнованиеСоставУчастников.МеждународнаяВозрастнаяГруппа = &Группа");
			Запрос.УстановитьПараметр("Группа", СоревнованиеГруппаСсылка);
			
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + СоревнованиеГруппа;
			
		КонецЕсли;
		
		Если Параметры.Свойство("СоревнованиеГруппаИПол") Тогда
			
			СоревнованиеГруппа = Параметры.СоревнованиеГруппаИПол;
			СоревнованиеГруппа = СтрЗаменить(СоревнованиеГруппа, " (М):", "");
			СоревнованиеГруппа = СтрЗаменить(СоревнованиеГруппа, " (Ж):", "");
			СоревнованиеГруппаСсылка = Справочники.МеждународныеВозрастныеГруппы.НайтиПоНаименованию(СоревнованиеГруппа, Истина);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "СоревнованиеСоставУчастников.МеждународнаяВозрастнаяГруппа = &Группа");
			Запрос.УстановитьПараметр("Группа", СоревнованиеГруппаСсылка);
			
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + СоревнованиеГруппа;
			
		КонецЕсли;
			
		Если Параметры.Свойство("СоревнованиеПол") Тогда
			
			СоревнованиеПол = ?(Параметры.СоревнованиеПол = "мужчины", Перечисления.ПолФизическогоЛица.Мужской, Перечисления.ПолФизическогоЛица.Женский); 
					
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "2 = 2", "СоревнованиеСоставУчастников.Спортсмен.ФизическоеЛицо.Пол = &Пол");
			Запрос.УстановитьПараметр("Пол", СоревнованиеПол);
			
			ЭтаФорма.Заголовок = ЭтаФорма.Заголовок + " " + СоревнованиеГруппа;
			
		КонецЕсли;	
		
		ТаблицаУчастников = Запрос.Выполнить().Выгрузить();
		
		Массив = Новый Массив;
		Для Сч = 1 По ТаблицаУчастников.Количество() Цикл
		    Массив.Добавить(Сч);
		КонецЦикла;
		ТаблицаУчастников.ЗагрузитьКолонку(Массив, "НомерСтроки");
		
		Если ИмяСтраницы = "СоревнованиеУчастники" Тогда
			СоревнованиеУчастники.Загрузить(ТаблицаУчастников);
			
		ИначеЕсли ИмяСтраницы = "Команды" Тогда
			// {Рарус dotere #20267 -Удаление пустых комманд 2021.09.29
			ТаблицаУчастников.Свернуть("Команда", "");
			//Для каждого строка из ТаблицаУчастников Цикл
			//	Если Не ЗначениеЗаполнено(строка.Команда) Тогда
			//		ТаблицаУчастников.Удалить(строка);
			//	КонецЕсли;
			//КонецЦикла;
			// {Рарус dotere #SonarQube -1.0.0.4 2021.10.28
			Проход=ТаблицаУчастников.Количество();                                                                                                            
		    Пока Проход>0 Цикл
		        Если ПустаяСтрока(ТаблицаУчастников[Проход-1].Команда) Тогда
		            ТаблицаУчастников.Удалить(Проход-1);
		        КонецЕсли;     
		        Проход=Проход-1;
			КонецЦикла;
			// }Рарус dotere #SonarQube -1.0.0.4 2021.10.28
			СоревнованиеКоманды.Загрузить(ТаблицаУчастников);
			// }Рарус dotere #20267 -Удаление пустых комманд 2021.09.29
		ИначеЕсли ИмяСтраницы = "Заявки" Тогда
			
			ТаблицаЗаявок = Параметры.СоревнованиеЗаявки.Выгрузить();
		
			Массив = Новый Массив;
			Для Сч = 1 По ТаблицаЗаявок.Количество() Цикл
			    Массив.Добавить(Сч);
			КонецЦикла;
			ТаблицаЗаявок.ЗагрузитьКолонку(Массив, "НомерСтроки");
				
			СоревнованиеЗаявки.Загрузить(ТаблицаЗаявок);
		КонецЕсли;	
		
	ИначеЕсли Раздел = "ГруппыОбщее" Тогда
		
		ЭтаФорма.Заголовок = "Тренерский состав в текущем учебном году";	
		
		ТаблицаТренеров = Параметры.ТЗТренеры.Выгрузить();
		
		Массив = Новый Массив;
		Для Сч = 1 По ТаблицаТренеров.Количество() Цикл
		    Массив.Добавить(Сч);
		КонецЦикла;
		ТаблицаТренеров.ЗагрузитьКолонку(Массив, "НомерСтроки");
			
		ГруппаОбщееТренеры.Загрузить(ТаблицаТренеров);
        
    ИначеЕсли Раздел = "ТренерыСпортсменыЭтапа" Тогда
        
        ЭтапСП = Параметры.ЭтапСП;
        ВидСпортаСП = Параметры.ВидСпорта;
		
		ЭтаФорма.Заголовок = "Спортсмены, занимающиеся на этапе спортивной подготовки: "+ЭтапСП+" ("+ВидСпортаСП+")";	
        
        Сч = 1;
        ТЗУчастниковЭтаповСП = Параметры.ТЗСпортсмены.Выгрузить();
        
        Отбор = Новый Структура("Этап,ВидСпорта",ЭтапСП,ВидСпортаСП);
        МассивСтрокУчастников = ТЗУчастниковЭтаповСП.НайтиСтроки(Отбор);

        Для каждого СтрокаУч Из МассивСтрокУчастников Цикл
        
        	 НоваяСтрокаУч = ТренерУчастники.Добавить();
             ЗаполнитьЗначенияСвойств(НоваяСтрокаУч,СтрокаУч);
             НоваяСтрокаУч.НомерСтроки = Сч;
             Сч = Сч + 1;
             
        КонецЦикла; 
        
    ИначеЕсли Раздел = "Этапы" Тогда	
		
		ЭтапСсылка = Параметры.ЭтапСсылка;
		
		ЭтаФорма.Заголовок = "" + ЭтапСсылка.Наименование + ": Спортсмены в составе";
		
		ТаблицаУчастников = Параметры.ТЗУчастники.Выгрузить();
		
		Если Параметры.Свойство("ГодРождения") Тогда
			МассивСтрок = ТаблицаУчастников.НайтиСтроки(Новый Структура("ГодРождения", Параметры.ГодРождения));
			Для Сч = 1 По МассивСтрок.Количество() Цикл
				НоваяСтрока = ГруппаУчастники.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивСтрок[Сч - 1]);
				НоваяСтрока.НомерСтроки = Сч;
			КонецЦикла;
			
		ИначеЕсли Параметры.Свойство("Разряд") Тогда
			МассивСтрок = ТаблицаУчастников.НайтиСтроки(Новый Структура("Разряд", Параметры.Разряд));
			Для Сч = 1 По МассивСтрок.Количество() Цикл
				НоваяСтрока = ГруппаУчастники.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивСтрок[Сч - 1]);
				НоваяСтрока.НомерСтроки = Сч;
			КонецЦикла;	
			
		Иначе
			Массив = Новый Массив;
			Для Сч = 1 По ТаблицаУчастников.Количество() Цикл
			    Массив.Добавить(Сч);
			КонецЦикла;
			ТаблицаУчастников.ЗагрузитьКолонку(Массив, "НомерСтроки");
			
			ГруппаУчастники.Загрузить(ТаблицаУчастников);
		КонецЕсли;	
	КонецЕсли;
	
	УстановитьВидимость(ИмяСтраницы);
	
	// {Рарус adilas #11068 -Возрастные группы в соревновании 2021.03.09
	Если НЕ УчетСпортсменовВызовСервера.ТекущиеПараметрыФО().ВозрастныеГруппыОрганизация Тогда 	
		Элементы.СоревнованиеУчастникиМеждународнаяВозрастнаяГруппа.Видимость    = Ложь;
	КонецЕсли;
	
	// }Рарус adilas #11068 -Возрастные группы в соревновании 2021.03.09
		
КонецПроцедуры

&НаСервере
Функция НайтиГруппу(СоревнованиеГруппа)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	МеждународныеВозрастныеГруппы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.МеждународныеВозрастныеГруппы КАК МеждународныеВозрастныеГруппы
		|ГДЕ
		|	МеждународныеВозрастныеГруппы.Наименование = &ВозрастнаяГруппа";
	
	Запрос.УстановитьПараметр("ВозрастнаяГруппа", СоревнованиеГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимость(ИмяСтраницы)
	
	Элементы["Группа" + ИмяСтраницы].Видимость = Истина;
	Элементы.СоревнованиеУчастникиКоманда.Видимость = ЭтоСоревнование;
	
КонецПроцедуры	

&НаКлиенте
Процедура ГруппаУчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ТекДанные = Элемент.ТекущиеДанные;
    
    Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Спортсмен)Тогда
    
    	ПоказатьЗначение(,ТекДанные.Спортсмен);
    
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбщееТренерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ТекДанные = Элемент.ТекущиеДанные;
    
    Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Тренер)Тогда
    
    	ПоказатьЗначение(,ТекДанные.Тренер);
    
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТренерУчастникиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    ТекДанные = Элемент.ТекущиеДанные;
    
    Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Спортсмен)Тогда
    
    	ПоказатьЗначение(,ТекДанные.Спортсмен);
    
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
